doc/insert_example.xml

<?xml version="1.0" encoding="utf-8"?>
<soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" 
    xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
    xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">
    <soap12:Body>
        <ProcessOperation xmlns="http://www.iet-solutions.de/">
            <identId>user_test</identId>
            <password>user_test</password>
            <prozess>SE INQ NET EYE WS</prozess>
            <version>1.0</version>
            <processData>
                <ins>
                    <label_monitoring>vfora-e01</label_monitoring>
                    <shortdesc>Event: CPU - CPU Usage : 93 </shortdesc>
                    <inquiry_txt>Descrizione estesa</inquiry_txt>
                    <se_severity>CRITICAL</se_severity>
                </ins>
            </processData>
        </ProcessOperation>
    </soap12:Body>
</soap12:Envelope>